package 再帰.フィボナッチ数列;

/**
 * フィボナッチ数列
 *
 * <p>
 * Jack は魔法使いからもらった豆を裏庭に植えて昼寝をしました。
 * 昼寝から目覚めて裏庭を確認するとその豆は巨木へと成長し、雲の上にある巨人の城にたどりつくまでの大きさになっていました。
 * 豆を観察すると、以下の条件で 1 秒ずつ成長することがわかりました。
 *
 * f(0) = 0
 * f(1) = 1
 * f(n) = f(n-1) + f(n-2) (n ≥ 2)
 * 整数 n が与えられるので、n 秒後の木の高さを求める、fibonacci という関数を作成してください。
 *
 * <p>
 * <p>
 * 入力のデータ型： integer n
 * 出力のデータ型： integer
 *
 * fibonacci(5) --> 5
 * fibonacci(9) --> 34
 * fibonacci(10) --> 55
 * fibonacci(19) --> 4181
 */

class Problem1 {
    public static int fibonacci(int n){
        // 関数を完成させてください
    }
}

